Repository: ultima6-tw/video-merger-mac
Catalog: app/Sources/Localizable.xcstrings
Source language: en
Languages: zh_hant

source: Silent segments removed — saved to: %@
zh_hant: 已移除靜音片段，儲存於：%@

source: Done: %@
zh_hant: 完成：%@

source: Detecting silence…%@%%
zh_hant: 偵測靜音中…%@%%

source: Detected %@ silent range(s) (leading/trailing ignored). Check the ones to remove:
zh_hant: 偵測到 %@ 段中段靜音（已忽略開頭／結尾），勾選要標記移除的片段：

source: %@ – %@ (%@s)
zh_hant: %@ – %@（%@秒）

source: Silence detection failed: %@
zh_hant: 靜音偵測失敗：%@

source: Silent range: %@ – %@ (±2s context)
zh_hant: 靜音片段：%@ – %@（前後各留 2 秒）

source: Can't find %@. Make sure it's installed via Homebrew (brew install %@).
zh_hant: 找不到 %@，請確認已透過 Homebrew 安裝（brew install %@）。

source: Couldn't read format info for “%@”: %@
zh_hant: 無法讀取「%@」的格式資訊： %@

source: Merge failed: %@
zh_hant: 合併失敗： %@

source: Silence detection failed for “%@”: %@
zh_hant: 「%@」靜音偵測失敗： %@

source: Precise cutting currently only supports H.264 video / AAC audio sources: %@
zh_hant: 目前只支援 H.264 視訊／AAC 音訊來源做精準切除：%@

source: Failed to remove silent segments: %@
zh_hant: 移除靜音片段失敗： %@

source: Video codec: %@ vs %@
zh_hant: 視訊編碼：%@ vs %@

source: Resolution: %@x%@ vs %@x%@
zh_hant: 解析度：%@x%@ vs %@x%@

source: Frame rate: %@ vs %@
zh_hant: 幀率：%@ vs %@

source: Pixel format: %@ vs %@
zh_hant: 像素格式：%@ vs %@

source: Audio codec: %@ vs %@
zh_hant: 音訊編碼：%@ vs %@

source: Sample rate: %@ vs %@
zh_hant: 取樣率：%@ vs %@

source: Channels: %@ vs %@
zh_hant: 聲道數：%@ vs %@

source: Video codec is %@
zh_hant: 視訊編碼是 %@

source: Audio codec is %@
zh_hant: 音訊編碼是 %@

source: Copying segment %@/%@…
zh_hant: 複製片段 %@/%@…

source: Re-encoding cut point %@/%@ (before)…
zh_hant: 重新編碼切點 %@/%@（前）…

source: Re-encoding cut point %@/%@ (after)…
zh_hant: 重新編碼切點 %@/%@（後）…

source: Failed to read keyframes: %@
zh_hant: 讀取關鍵影格失敗： %@

source: Video timescale: %@ vs %@ (mismatched timescales muxed together via -c copy can overflow the DTS calculation and crash — not just a quality issue)
zh_hant: 視訊 timescale：%@ vs %@（timescale 不一致混在一起 -c copy，muxer 算 DTS 可能溢位直接崩潰，不是單純畫質問題）

source: “%@” and “%@” have incompatible formats and can't be losslessly merged: %@ Won't re-encode automatically — please check the source files and try again.
zh_hant: 「%@」與「%@」格式不相容，無法無損合併： %@ 不會自動重新編碼，請確認來源檔案後再試。

source: No audio
zh_hant: 無音訊

source: Checking format compatibility…
zh_hant: 檢查格式相容性…

source: Merging…
zh_hant: 合併中…

source: Choose Output Location
zh_hant: 選擇輸出位置

source: Preparing to remove segments…
zh_hant: 準備移除片段…

source: Unknown error
zh_hant: 未知錯誤

source: No video track found — check that this is a valid video file
zh_hant: 找不到視訊軌，確認這是有效的影片檔案

source: None
zh_hant: 無

source: Formats differ
zh_hant: 格式不一致

source: Couldn't read the source file's video timescale. Stopping rather than risk producing a file with a mismatched timescale (which can crash ffmpeg when merging).
zh_hant: 讀不到原始檔案的 video timescale，為了避免切出來的檔案 timescale 跟原始不一致（合併時會導致 ffmpeg 崩潰），不繼續執行

source: Couldn't determine file duration
zh_hant: 找不到檔案總長度

source: No segments selected for removal
zh_hant: 沒有選擇要移除的片段

source: Reading keyframe positions…
zh_hant: 讀取關鍵影格位置…

source: Copying final segment…
zh_hant: 複製最後一段…

source: Stitching segments back together…
zh_hant: 接回所有片段…

source: Drop mp4 files here, or click “Add Files” below
zh_hant: 把 mp4 檔案拖曳到這裡，或按下方「加入檔案」

source: Reading format…
zh_hant: 讀取格式中…

source: Detecting silence…
zh_hant: 偵測靜音中…

source: No mid-clip silence detected (leading/trailing silence ignored)
zh_hant: 沒有偵測到中段靜音片段（已忽略開頭／結尾）

source: Extended: includes frozen frame
zh_hant: 含畫面凍結，已延伸

source: Add Files
zh_hant: 加入檔案

source: Clear
zh_hant: 清空

source: Merge
zh_hant: 合併

source: Detect Silence
zh_hant: 偵測靜音

source: Remove Selected (Save As New File)
zh_hant: 移除所選片段（輸出新檔案）

source: Close
zh_hant: 關閉
